This notebook demonstrates how to calculate t-weight and d-weight using python for given data.

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [2]:
data = pd.read_csv('data_t_d_weight.csv')

In [3]:
data

  Location    A    B
0      Mum  100   50
1     Pune  130  120
2    Delhi   80   30
3      Hyd   70   70
4     Beng   20   30
5      Che  200  100

Adding column _total_ for summation of columns _A_ and _B_.

In [4]:
data['total'] = data['A']+data['B']

Dataframe after adding total column.

In [5]:
data

  Location    A    B  total
0      Mum  100   50    150
1     Pune  130  120    250
2    Delhi   80   30    110
3      Hyd   70   70    140
4     Beng   20   30     50
5      Che  200  100    300

Calculating _t-weight_ and _d-weight_ as per

t-weight_subclass = value_sub_class / total_class <br>
d-weight_subclass = value_sub_class / sum(total_class)

In [6]:
#for t-weight
data['A_T_wt']=data['A']/data['total']
data['B_T_wt']=data['B']/data['total']

#for d-weight
data['A_D_wt']=data['A']/sum(data['total'])
data['B_D_wt']=data['B']/sum(data['total'])


#for printing weights
data

  Location    A    B  total    A_T_wt    B_T_wt  A_D_wt  B_D_wt
0      Mum  100   50    150  0.666667  0.333333    0.10    0.05
1     Pune  130  120    250  0.520000  0.480000    0.13    0.12
2    Delhi   80   30    110  0.727273  0.272727    0.08    0.03
3      Hyd   70   70    140  0.500000  0.500000    0.07    0.07
4     Beng   20   30     50  0.400000  0.600000    0.02    0.03
5      Che  200  100    300  0.666667  0.333333    0.20    0.10